//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ТекущаяДата(Парам01)","ТекущаяДата","И текущая дата 19.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РассчетВозрастаВМесяцахДолженБыть(Парам01)","РассчетВозрастаВМесяцахДолженБыть","Тогда рассчет возраста в месяцах должен быть 494");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьДатаРожденияСотрудника(Парам01)","УМеняЕстьДатаРожденияСотрудника","Допустим у меня есть дата рождения сотрудника 15.06.1975");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаСегодня(Парам01)","ДатаСегодня","И дата сегодня 19.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РасчетВозрастаВМесяцахДолженБыть(Парам01)","РасчетВозрастаВМесяцахДолженБыть","Тогда расчет возраста в месяцах должен быть 494");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим у меня есть дата рождения сотрудника 15.06.1975
//@УМеняЕстьДатаРожденияСотрудника(Парам01)
Процедура УМеняЕстьДатаРожденияСотрудника(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И текущая дата 19.08.2016
//@ТекущаяДата(Парам01)
Процедура ТекущаяДата(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда рассчет возраста в месяцах должен быть 494
//@РассчетВозрастаВМесяцахДолженБыть(Парам01)
Процедура РассчетВозрастаВМесяцахДолженБыть(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля

&НаКлиенте
//И дата сегодня 19.08.2016
//@ДатаСегодня(Парам01)
Процедура ДатаСегодня(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда расчет возраста в месяцах должен быть 494
//@РасчетВозрастаВМесяцахДолженБыть(Парам01)
Процедура РасчетВозрастаВМесяцахДолженБыть(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры
